Revit 2027 API
FilteredElementCollector.OfCategoryId Method
 Applies an ElementCategoryFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector OfCategoryId(
	ElementId categoryId
)
Public Function OfCategoryId (
	categoryId As ElementId
) As FilteredElementCollector
public:
FilteredElementCollector^ OfCategoryId(
	ElementId^ categoryId
)
member OfCategoryId :
        categoryId : ElementId -> FilteredElementCollector
Parameters
categoryId ElementId
 The category id.
Return Value
FilteredElementCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only elements of this category id will pass the collector. If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace